# Data Visualization with Modern Data Science

> Data Definition and Manipulation with SQL

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com)

In [1]:
%LOAD sqlite3 db=data/demo.db timeout=2 shared_cache=true

## (Recap)Subcategories of SQL

- DQL, short for **Data Query Language**.
- DML, short for **Data Manipulation Language**.
- DDL, short for **Data Definition Language**.
- DCL, short for **Data Control Language**.
- TCL, short for **Transaction Control Language**.

## (Recap)Subcategories of SQL(Cont'd)

- DQL: statements begin with `SELECT`.
- DML: statements begin with `INSERT`, `UPDATE`, `DELETE`...etc.
- DDL: statements begin with `CREATE`, `DROP`, `ALTER`...etc.
- DCL: statements begin with `GRANT`, `REVOKE`...etc.
- TCL: statements begin with `COMMIT`, `ROLLBACK`...etc.

## (Recap)What will be covered in this course

- DQL.
- A bit of DML.
- A bit of DDL.
- ~~DCL.~~
- A little bit of TCL.

## Data Definition with SQL

## DDL(Data Definition Language)

- `CREATE` tables.
- `CREATE` views.

## What are tables?

> A table is a collection of related data held in a table format within a database. It consists of columns and rows.In relational databases, and flat file databases, a table is a set of data elements (values) using a model of vertical columns (identifiable by name) and horizontal rows, the cell being the unit where a row and column intersect. A table has a specified number of columns, but can have any number of rows.

Source: <https://en.wikipedia.org/wiki/Table_(database)>

## Planning a database

1. Design questions.
2. Data questions.
3. Security questions.

## Design questions

- What are the business requirements?
- What tables will I need to fulfill those requirements?
- What columns will each table contain?
- ...etc.

## Data questions

- How much data will be populated into these tables?
- Where will the data come from?
- Do we need processes to automatically populate the tables?
- ...etc.

## Security questions

- Who should have access to this database?
- Who should have access to which tables? Read-only access? Write access?
- Is this database critical to business operations?
- ...etc.

## Create a new database using SQLiteStudio

Database > Add a Database.

![](https://i.imgur.com/ioRzyif.png)

## `CREATE` statement

```sql
CREATE TABLE table_name (
    column_name DATA_TYPE CONSTRAINTS,
    column_name DATA_TYPE
);
```

In [2]:
DROP TABLE IF EXISTS movies;

In [3]:
CREATE TABLE movies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    year INTEGER,
    rating REAL
);

## After `CREATE` statement

In [4]:
SELECT *
  FROM movies;

Empty set (0.00 sec)

In [5]:
SELECT COUNT(*)
  FROM movies;

+----------+
| COUNT(*) |
+----------+
| 0        |
+----------+
1 row in set (0.00 sec)

In [6]:
INSERT INTO movies (title, year, rating)
VALUES 
    ('The Shawshank Redemption', 1994, 9.2),
    ('The Godfather', 1972, 9.1),
    ('The Dark Knight', 2008, 9.0),
    ('Forrest Gump', 1994, 8.8);

## After multiple `INSERT`s

In [7]:
SELECT *
  FROM movies;

+----+--------------------------+------+--------+
| id | title                    | year | rating |
+----+--------------------------+------+--------+
| 1  | The Shawshank Redemption | 1994 | 9.2    |
+----+--------------------------+------+--------+
| 2  | The Godfather            | 1972 | 9.1    |
+----+--------------------------+------+--------+
| 3  | The Dark Knight          | 2008 | 9      |
+----+--------------------------+------+--------+
| 4  | Forrest Gump             | 1994 | 8.8    |
+----+--------------------------+------+--------+
4 rows in set (0.00 sec)

In [8]:
SELECT COUNT(*)
  FROM movies;

+----------+
| COUNT(*) |
+----------+
| 4        |
+----------+
1 row in set (0.00 sec)

In [9]:
CREATE TABLE actors (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    movie_id INTEGER,
    FOREIGN KEY (movie_id) REFERENCES movies (id)
);

In [10]:
INSERT INTO actors (name, movie_id)
VALUES 
    ('Tim Robbins', 1),
    ('Morgan Freeman', 1),
    ('Marlon Brando', 2),
    ('Al Pacino', 2),
    ('Christian Bale', 3),
    ('Heath Ledger', 3),
    ('Tom Hanks', 4),
    ('Robin Wright', 4);

In [11]:
SELECT *
  FROM actors;

+----+----------------+----------+
| id | name           | movie_id |
+----+----------------+----------+
| 1  | Tim Robbins    | 1        |
+----+----------------+----------+
| 2  | Morgan Freeman | 1        |
+----+----------------+----------+
| 3  | Marlon Brando  | 2        |
+----+----------------+----------+
| 4  | Al Pacino      | 2        |
+----+----------------+----------+
| 5  | Christian Bale | 3        |
+----+----------------+----------+
| 6  | Heath Ledger   | 3        |
+----+----------------+----------+
| 7  | Tom Hanks      | 4        |
+----+----------------+----------+
| 8  | Robin Wright   | 4        |
+----+----------------+----------+
8 rows in set (0.00 sec)

In [12]:
SELECT *
  FROM movies
  JOIN actors
    ON movies.id = actors.movie_id;

+----+--------------------------+------+--------+----+----------------+----------+
| id | title                    | year | rating | id | name           | movie_id |
+----+--------------------------+------+--------+----+----------------+----------+
| 1  | The Shawshank Redemption | 1994 | 9.2    | 1  | Tim Robbins    | 1        |
+----+--------------------------+------+--------+----+----------------+----------+
| 1  | The Shawshank Redemption | 1994 | 9.2    | 2  | Morgan Freeman | 1        |
+----+--------------------------+------+--------+----+----------------+----------+
| 2  | The Godfather            | 1972 | 9.1    | 3  | Marlon Brando  | 2        |
+----+--------------------------+------+--------+----+----------------+----------+
| 2  | The Godfather            | 1972 | 9.1    | 4  | Al Pacino      | 2        |
+----+--------------------------+------+--------+----+----------------+----------+
| 3  | The Dark Knight          | 2008 | 9      | 5  | Christian Bale | 3        |
+----+--------------------------+------+--------+----+----------------+----------+
| 3  | The Dark Knight          | 2008 | 9      | 6  | Heath Ledger   | 3        |
+----+--------------------------+------+--------+----+----------------+----------+
| 4  | Forrest Gump             | 1994 | 8.8    | 7  | Tom Hanks      | 4        |
+----+--------------------------+------+--------+----+----------------+----------+
| 4  | Forrest Gump             | 1994 | 8.8    | 8  | Robin Wright   | 4        |
+----+--------------------------+------+--------+----+----------------+----------+
8 rows in set (0.00 sec)

## `DROP` statement

```sql
DROP TABLE IF EXISTS table_name;
```

In [13]:
DROP TABLE IF EXISTS movies;

In [14]:
DROP TABLE IF EXISTS actors;

## After `DROP` statement

```sql
SELECT *
  FROM movies;
```

```
Error: sqlite3_statement_backend::prepare: no such table: movies while preparing "SELECT *
  FROM movies;".
```

## After `DROP` statement(Cont'd)

```sql
SELECT *
  FROM actors;
```

```
Error: sqlite3_statement_backend::prepare: no such table: actors while preparing "SELECT *
  FROM actors;".
```

## We can also use SQLiteStudio to import CSV file as a table

![](https://i.imgur.com/qhMFMRP.png)

## Try `DROP DATABASE covid19.db` and create from scratch

- [daily_report.csv](https://classroom-data-viz.s3.ap-northeast-1.amazonaws.com/daily_report.csv)
- [lookup_table.csv](https://classroom-data-viz.s3.ap-northeast-1.amazonaws.com/lookup_table.csv)
- [time_series.csv](https://classroom-data-viz.s3.ap-northeast-1.amazonaws.com/time_series.csv)

## What are views?

> In a database, a view is the result set of a stored query on the data, which the database users can query just as they would in a persistent database collection object. This pre-established query command is kept in the database dictionary.

Source: <https://en.wikipedia.org/wiki/View_(SQL)>

## Views are like

- A persistent sub-query.
- A stored `SELECT` statement that feels like a table for users.
- A feature lies between sub-queries and creating a table.

## `CREATE VIEW` statement

```sql
CREATE VIEW view_name (column_names)
    AS
SELECT ...;
```

## The incidence rate summary

In [15]:
%LOAD sqlite3 db=data/covid19.db timeout=2 shared_cache=true

In [16]:
SELECT lookup_table.Country_Region,
       SUM(daily_report.Confirmed)*100000 / SUM(lookup_table.Population) AS Incidence_Rate
  FROM daily_report
  JOIN lookup_table
    ON daily_report.Combined_Key = lookup_table.Combined_Key
 GROUP BY lookup_table.Country_Region
 ORDER BY Incidence_Rate DESC;

+----------------------------------+----------------+
| Country_Region                   | Incidence_Rate |
+----------------------------------+----------------+
| San Marino                       | 69028          |
+----------------------------------+----------------+
| Austria                          | 64179          |
+----------------------------------+----------------+
| Slovenia                         | 63570          |
+----------------------------------+----------------+
| Brunei                           | 63103          |
+----------------------------------+----------------+
| Andorra                          | 61915          |
+----------------------------------+----------------+
| Iceland                          | 61153          |
+----------------------------------+----------------+
| Korea, South                     | 58899          |
+----------------------------------+----------------+
| France                           | 58315          |
+----------------------------------+----------------+
| Denmark                          | 57992          |
+----------------------------------+----------------+
| Liechtenstein                    | 55979          |
+----------------------------------+----------------+
| Israel                           | 55296          |
+----------------------------------+----------------+
| Portugal                         | 54565          |
+----------------------------------+----------------+
| Greece                           | 53232          |
+----------------------------------+----------------+
| Cyprus                           | 53228          |
+----------------------------------+----------------+
| Latvia                           | 51706          |
+----------------------------------+----------------+
| Seychelles                       | 51520          |
+----------------------------------+----------------+
| Switzerland                      | 50931          |
+----------------------------------+----------------+
| Luxembourg                       | 50278          |
+----------------------------------+----------------+
| Netherlands                      | 48993          |
+----------------------------------+----------------+
| Slovakia                         | 48957          |
+----------------------------------+----------------+
| Lithuania                        | 47625          |
+----------------------------------+----------------+
| Estonia                          | 46278          |
+----------------------------------+----------------+
| Montenegro                       | 45593          |
+----------------------------------+----------------+
| Georgia                          | 45477          |
+----------------------------------+----------------+
| Germany                          | 45433          |
+----------------------------------+----------------+
| New Zealand                      | 45237          |
+----------------------------------+----------------+
| Australia                        | 44365          |
+----------------------------------+----------------+
| Czechia                          | 42856          |
+----------------------------------+----------------+
| Nauru                            | 42652          |
+----------------------------------+----------------+
| Italy                            | 42169          |
+----------------------------------+----------------+
| Bahrain                          | 41164          |
+----------------------------------+----------------+
| Monaco                           | 40931          |
+----------------------------------+----------------+
| Belgium                          | 40821          |
+----------------------------------+----------------+
| Taiwan                           | 40046          |
+----------------------------------+----------------+
| Singapore                        | 37897          |
+----------------------------------+----------------+
| Barbados                         | 36940          |
+----------------------------------+----------------+
| United Kingdom                   | 36497          |
+----------------------------------+----------------+
| Ireland                          | 34433          |
+----------------------------------+----------------+
| Maldives                         | 34357          |
+----------------------------------+----------------+
| Palau                            | 33240          |
+----------------------------------+----------------+
| Croatia                          | 30876          |
+----------------------------------+----------------+
| US                               | 30802          |
+----------------------------------+----------------+
| Mongolia                         | 30743          |
+----------------------------------+----------------+
| Uruguay                          | 29729          |
+----------------------------------+----------------+
| Spain                            | 29255          |
+----------------------------------+----------------+
| Chile                            | 29123          |
+----------------------------------+----------------+
| Serbia                           | 28283          |
+----------------------------------+----------------+
| Norway                           | 27260          |
+----------------------------------+----------------+
| Marshall Islands                 | 26678          |
+----------------------------------+----------------+
| Malta                            | 26512          |
+----------------------------------+----------------+
| Finland                          | 26325          |
+----------------------------------+----------------+
| Sweden                           | 26080          |
+----------------------------------+----------------+
| Japan                            | 25803          |
+----------------------------------+----------------+
| Panama                           | 23864          |
+----------------------------------+----------------+
| Tuvalu                           | 23787          |
+----------------------------------+----------------+
| Costa Rica                       | 23285          |
+----------------------------------+----------------+
| Mauritius                        | 23164          |
+----------------------------------+----------------+
| Hungary                          | 22688          |
+----------------------------------+----------------+
| Argentina                        | 22208          |
+----------------------------------+----------------+
| Dominica                         | 21891          |
+----------------------------------+----------------+
| Turkey                           | 20207          |
+----------------------------------+----------------+
| Micronesia                       | 19923          |
+----------------------------------+----------------+
| Bulgaria                         | 18643          |
+----------------------------------+----------------+
| Lebanon                          | 18000          |
+----------------------------------+----------------+
| Belize                           | 17770          |
+----------------------------------+----------------+
| Brazil                           | 17523          |
+----------------------------------+----------------+
| Grenada                          | 17490          |
+----------------------------------+----------------+
| Romania                          | 17283          |
+----------------------------------+----------------+
| Jordan                           | 17122          |
+----------------------------------+----------------+
| Qatar                            | 17093          |
+----------------------------------+----------------+
| Poland                           | 16855          |
+----------------------------------+----------------+
| North Macedonia                  | 16628          |
+----------------------------------+----------------+
| Saint Lucia                      | 16230          |
+----------------------------------+----------------+
| Tonga                            | 15832          |
+----------------------------------+----------------+
| Kuwait                           | 15521          |
+----------------------------------+----------------+
| Malaysia                         | 15434          |
+----------------------------------+----------------+
| Kosovo                           | 15054          |
+----------------------------------+----------------+
| Armenia                          | 15051          |
+----------------------------------+----------------+
| Moldova                          | 14863          |
+----------------------------------+----------------+
| Russia                           | 14757          |
+----------------------------------+----------------+
| Botswana                         | 13999          |
+----------------------------------+----------------+
| Suriname                         | 13981          |
+----------------------------------+----------------+
| West Bank and Gaza               | 13784          |
+----------------------------------+----------------+
| Peru                             | 13735          |
+----------------------------------+----------------+
| Trinidad and Tobago              | 13426          |
+----------------------------------+----------------+
| Colombia                         | 13164          |
+----------------------------------+----------------+
| Saint Kitts and Nevis            | 12392          |
+----------------------------------+----------------+
| Ukraine                          | 12373          |
+----------------------------------+----------------+
| Bosnia and Herzegovina           | 12234          |
+----------------------------------+----------------+
| Canada                           | 11933          |
+----------------------------------+----------------+
| Vietnam                          | 11841          |
+----------------------------------+----------------+
| Albania                          | 11611          |
+----------------------------------+----------------+
| Cabo Verde                       | 11372          |
+----------------------------------+----------------+
| Paraguay                         | 11303          |
+----------------------------------+----------------+
| United Arab Emirates             | 10610          |
+----------------------------------+----------------+
| Belarus                          | 10519          |
+----------------------------------+----------------+
| Bolivia                          | 10177          |
+----------------------------------+----------------+
| Cuba                             | 9821           |
+----------------------------------+----------------+
| Tunisia                          | 9733           |
+----------------------------------+----------------+
| Bahamas                          | 9533           |
+----------------------------------+----------------+
| Antigua and Barbuda              | 9298           |
+----------------------------------+----------------+
| Guyana                           | 9274           |
+----------------------------------+----------------+
| Iran                             | 9005           |
+----------------------------------+----------------+
| Saint Vincent and the Grenadines | 8639           |
+----------------------------------+----------------+
| Samoa                            | 8202           |
+----------------------------------+----------------+
| Azerbaijan                       | 8165           |
+----------------------------------+----------------+
| Bhutan                           | 8113           |
+----------------------------------+----------------+
| Kazakhstan                       | 7970           |
+----------------------------------+----------------+
| Oman                             | 7822           |
+----------------------------------+----------------+
| Fiji                             | 7676           |
+----------------------------------+----------------+
| Libya                            | 7380           |
+----------------------------------+----------------+
| Guatemala                        | 6853           |
+----------------------------------+----------------+
| South Africa                     | 6838           |
+----------------------------------+----------------+
| Thailand                         | 6772           |
+----------------------------------+----------------+
| Namibia                          | 6719           |
+----------------------------------+----------------+
| Eswatini                         | 6389           |
+----------------------------------+----------------+
| Iraq                             | 6129           |
+----------------------------------+----------------+
| Dominican Republic               | 6085           |
+----------------------------------+----------------+
| Ecuador                          | 5958           |
+----------------------------------+----------------+
| Mexico                           | 5765           |
+----------------------------------+----------------+
| Jamaica                          | 5180           |
+----------------------------------+----------------+
| Honduras                         | 4752           |
+----------------------------------+----------------+
| Kiribati                         | 4258           |
+----------------------------------+----------------+
| Vanuatu                          | 4104           |
+----------------------------------+----------------+
| Solomon Islands                  | 3764           |
+----------------------------------+----------------+
| Philippines                      | 3717           |
+----------------------------------+----------------+
| Holy See                         | 3584           |
+----------------------------------+----------------+
| Morocco                          | 3446           |
+----------------------------------+----------------+
| Nepal                            | 3435           |
+----------------------------------+----------------+
| India                            | 3258           |
+----------------------------------+----------------+
| Kyrgyzstan                       | 3166           |
+----------------------------------+----------------+
| Sri Lanka                        | 3138           |
+----------------------------------+----------------+
| El Salvador                      | 3110           |
+----------------------------------+----------------+
| Laos                             | 2995           |
+----------------------------------+----------------+
| Sao Tome and Principe            | 2865           |
+----------------------------------+----------------+
| Indonesia                        | 2460           |
+----------------------------------+----------------+
| Saudi Arabia                     | 2378           |
+----------------------------------+----------------+
| Gabon                            | 2200           |
+----------------------------------+----------------+
| Venezuela                        | 1939           |
+----------------------------------+----------------+
| Zambia                           | 1853           |
+----------------------------------+----------------+
| Timor-Leste                      | 1775           |
+----------------------------------+----------------+
| Zimbabwe                         | 1760           |
+----------------------------------+----------------+
| Lesotho                          | 1623           |
+----------------------------------+----------------+
| Djibouti                         | 1588           |
+----------------------------------+----------------+
| Mauritania                       | 1369           |
+----------------------------------+----------------+
| Bangladesh                       | 1237           |
+----------------------------------+----------------+
| Equatorial Guinea                | 1225           |
+----------------------------------+----------------+
| Burma                            | 1164           |
+----------------------------------+----------------+
| Comoros                          | 1034           |
+----------------------------------+----------------+
| Rwanda                           | 1027           |
+----------------------------------+----------------+
| Cambodia                         | 829            |
+----------------------------------+----------------+
| Pakistan                         | 758            |
+----------------------------------+----------------+
| Uzbekistan                       | 748            |
+----------------------------------+----------------+
| Mozambique                       | 742            |
+----------------------------------+----------------+
| Kenya                            | 637            |
+----------------------------------+----------------+
| Algeria                          | 618            |
+----------------------------------+----------------+
| Ghana                            | 550            |
+----------------------------------+----------------+
| Afghanistan                      | 535            |
+----------------------------------+----------------+
| Senegal                          | 530            |
+----------------------------------+----------------+
| Papua New Guinea                 | 522            |
+----------------------------------+----------------+
| Gambia                           | 520            |
+----------------------------------+----------------+
| Egypt                            | 503            |
+----------------------------------+----------------+
| Togo                             | 475            |
+----------------------------------+----------------+
| Cameroon                         | 467            |
+----------------------------------+----------------+
| Malawi                           | 462            |
+----------------------------------+----------------+
| Congo (Brazzaville)              | 459            |
+----------------------------------+----------------+
| Guinea-Bissau                    | 454            |
+----------------------------------+----------------+
| Burundi                          | 448            |
+----------------------------------+----------------+
| Ethiopia                         | 434            |
+----------------------------------+----------------+
| Uganda                           | 372            |
+----------------------------------+----------------+
| China                            | 345            |
+----------------------------------+----------------+
| Cote d'Ivoire                    | 333            |
+----------------------------------+----------------+
| Syria                            | 328            |
+----------------------------------+----------------+
| Angola                           | 320            |
+----------------------------------+----------------+
| Central African Republic         | 318            |
+----------------------------------+----------------+
| Haiti                            | 298            |
+----------------------------------+----------------+
| Guinea                           | 291            |
+----------------------------------+----------------+
| Eritrea                          | 287            |
+----------------------------------+----------------+
| Madagascar                       | 244            |
+----------------------------------+----------------+
| Nicaragua                        | 235            |
+----------------------------------+----------------+
| Benin                            | 230            |
+----------------------------------+----------------+
| Tajikistan                       | 186            |
+----------------------------------+----------------+
| Somalia                          | 171            |
+----------------------------------+----------------+
| South Sudan                      | 164            |

In [17]:
DROP VIEW IF EXISTS incidence_rate_by_country;

In [18]:
CREATE VIEW incidence_rate_by_country
    AS
SELECT lookup_table.Country_Region,
       SUM(daily_report.Confirmed)*100000 / SUM(lookup_table.Population) AS Incidence_Rate
  FROM daily_report
  JOIN lookup_table
    ON daily_report.Combined_Key = lookup_table.Combined_Key
 GROUP BY lookup_table.Country_Region
 ORDER BY Incidence_Rate DESC;

## Once a view is created, use it like a table

In [19]:
SELECT *
  FROM incidence_rate_by_country
 WHERE Country_Region = 'Taiwan';

+----------------+----------------+
| Country_Region | Incidence_Rate |
+----------------+----------------+
| Taiwan         | 40046          |
+----------------+----------------+
1 row in set (0.00 sec)

## Using views to demonstrate different `JOIN`s

In [20]:
DROP VIEW IF EXISTS daily_report_tw_kr;

In [21]:
CREATE VIEW daily_report_tw_kr
    AS
SELECT *
  FROM daily_report
 WHERE Combined_Key IN ('Taiwan', 'Korea, South');

In [22]:
DROP VIEW IF EXISTS lookup_table_tw_sg;

In [23]:
CREATE VIEW lookup_table_tw_sg
    AS
SELECT *
  FROM lookup_table
 WHERE iso2 IN ('TW', 'SG');

## `JOIN` returns rows from the left and the right table where matching values are found

In [24]:
SELECT daily_report_tw_kr.Combined_Key,
       daily_report_tw_kr.Confirmed,
       lookup_table_tw_sg.Population
  FROM daily_report_tw_kr
  JOIN lookup_table_tw_sg
    ON daily_report_tw_kr.Combined_Key = lookup_table_tw_sg.Combined_Key;

+--------------+-----------+------------+
| Combined_Key | Confirmed | Population |
+--------------+-----------+------------+
| Taiwan       | 9537823   | 23816775   |
+--------------+-----------+------------+
1 row in set (0.00 sec)

## `LEFT JOIN` returns all rows from the left table and display blank rows from the other table if no matching values are found

In [25]:
SELECT daily_report_tw_kr.Combined_Key,
       daily_report_tw_kr.Confirmed,
       lookup_table_tw_sg.Population
  FROM daily_report_tw_kr
  LEFT JOIN lookup_table_tw_sg
    ON daily_report_tw_kr.Combined_Key = lookup_table_tw_sg.Combined_Key;

+--------------+-----------+------------+
| Combined_Key | Confirmed | Population |
+--------------+-----------+------------+
| Korea, South | 30197066  | NULL       |
+--------------+-----------+------------+
| Taiwan       | 9537823   | 23816775   |
+--------------+-----------+------------+
2 rows in set (0.01 sec)

## `DROP` statement

```sql
DROP VIEW IF EXISTS view_name;
```

In [26]:
DROP VIEW IF EXISTS daily_report_tw_kr;

In [27]:
DROP VIEW IF EXISTS lookup_table_tw_sg;

## After `DROP` statement

```sql
SELECT *
  FROM daily_report_tw_kr;
```

```
Error: sqlite3_statement_backend::prepare: no such table: daily_report_tw_kr while preparing "SELECT *
  FROM daily_report_tw_kr;".
```

## After `DROP` statement(Cont'd)

```sql
SELECT *
  FROM lookup_table_tw_sg;
```

```
Error: sqlite3_statement_backend::prepare: no such table: lookup_table_tw_sg while preparing "SELECT *
  FROM lookup_table_tw_sg;".
```

## Data Manipulation with SQL

## DML(Data Manipulation Language)

- `INSERT`
- `DELETE`
- `UPDATE`

## `INSERT` statement

```sql
INSERT INTO table_name (column_names, ...)
VALUES (values, ...);
```

## Before `INSERT` statement

In [28]:
%LOAD sqlite3 db=data/demo.db timeout=2 shared_cache=true

In [29]:
CREATE TABLE movies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    year INTEGER,
    rating REAL
);

In [30]:
INSERT INTO movies (title, year, rating)
VALUES 
    ('The Shawshank Redemption', 1994, 9.2),
    ('The Godfather', 1972, 9.1),
    ('The Dark Knight', 2008, 9.0),
    ('Forrest Gump', 1994, 8.8);

In [31]:
SELECT *
  FROM movies;

+----+--------------------------+------+--------+
| id | title                    | year | rating |
+----+--------------------------+------+--------+
| 1  | The Shawshank Redemption | 1994 | 9.2    |
+----+--------------------------+------+--------+
| 2  | The Godfather            | 1972 | 9.1    |
+----+--------------------------+------+--------+
| 3  | The Dark Knight          | 2008 | 9      |
+----+--------------------------+------+--------+
| 4  | Forrest Gump             | 1994 | 8.8    |
+----+--------------------------+------+--------+
4 rows in set (0.00 sec)

In [32]:
INSERT INTO movies (title, year, rating)
VALUES ('Schindler''s List', 1993, 8.9);

## After `INSERT` statement

In [33]:
SELECT *
  FROM movies;

+----+--------------------------+------+--------+
| id | title                    | year | rating |
+----+--------------------------+------+--------+
| 1  | The Shawshank Redemption | 1994 | 9.2    |
+----+--------------------------+------+--------+
| 2  | The Godfather            | 1972 | 9.1    |
+----+--------------------------+------+--------+
| 3  | The Dark Knight          | 2008 | 9      |
+----+--------------------------+------+--------+
| 4  | Forrest Gump             | 1994 | 8.8    |
+----+--------------------------+------+--------+
| 5  | Schindler's List         | 1993 | 8.9    |
+----+--------------------------+------+--------+
5 rows in set (0.00 sec)

## Multiple `INSERT`s

```sql
INSERT INTO table_name (column_names, ...)
VALUES
(values, ...),
(values, ...);
```

In [34]:
INSERT INTO movies (title, year, rating)
VALUES
('Fight Club', 1999, 8.7),
('Parasite', 2019, 8.5);

## After multiple `INSERT` statements

In [35]:
SELECT *
  FROM movies;

+----+--------------------------+------+--------+
| id | title                    | year | rating |
+----+--------------------------+------+--------+
| 1  | The Shawshank Redemption | 1994 | 9.2    |
+----+--------------------------+------+--------+
| 2  | The Godfather            | 1972 | 9.1    |
+----+--------------------------+------+--------+
| 3  | The Dark Knight          | 2008 | 9      |
+----+--------------------------+------+--------+
| 4  | Forrest Gump             | 1994 | 8.8    |
+----+--------------------------+------+--------+
| 5  | Schindler's List         | 1993 | 8.9    |
+----+--------------------------+------+--------+
| 6  | Fight Club               | 1999 | 8.7    |
+----+--------------------------+------+--------+
| 7  | Parasite                 | 2019 | 8.5    |
+----+--------------------------+------+--------+
7 rows in set (0.00 sec)

## `DELETE` statement

```sql
-- delete all records in a table
DELETE FROM table_name;
-- delete specific records in a table
DELETE FROM table_name
 WHERE conditions;
```

In [36]:
DELETE FROM movies
 WHERE year < 2000;

## After `DELETE` statement

In [37]:
SELECT *
  FROM movies;

+----+-----------------+------+--------+
| id | title           | year | rating |
+----+-----------------+------+--------+
| 3  | The Dark Knight | 2008 | 9      |
+----+-----------------+------+--------+
| 7  | Parasite        | 2019 | 8.5    |
+----+-----------------+------+--------+
2 rows in set (0.00 sec)

## `UPDATE` statement

```sql
UPDATE table_name
   SET column_names = values,
       column_names = values
 WHERE conditions;
```

In [38]:
UPDATE movies
   SET title = 'Batman Trilogy: The Dark Knight'
 WHERE year = 2008;

## After `UPDATE` statement

In [39]:
SELECT *
  FROM movies;

+----+---------------------------------+------+--------+
| id | title                           | year | rating |
+----+---------------------------------+------+--------+
| 3  | Batman Trilogy: The Dark Knight | 2008 | 9      |
+----+---------------------------------+------+--------+
| 7  | Parasite                        | 2019 | 8.5    |
+----+---------------------------------+------+--------+
2 rows in set (0.00 sec)

## The `covid19.db` database

## Data sources

- `lookup_table`: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/UID_ISO_FIPS_LookUp_Table.csv>
- `daily_report`: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports>
- `time_series`
    - Confirmed: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv>
    - Deaths: <https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv>

## The ETL steps

1. Extract.
2. Transform.
3. Load.

Source: <https://nbviewer.org/github/datainpoint/classroom-data-viz-with-modern-ds-2023/blob/main/get_covid19_data.ipynb>

## Extract and Transform

```python
covid19 = Covid19()
lookup_table = covid19.get_lookup_table()
daily_report = covid19.get_daily_report('01-31-2023')
time_series = covid19.get_time_series()
```

## Load

```python
con = sqlite3.connect('covid19.db')
lookup_table.to_sql('lookup_table', con, if_exists='replace', index=False)
daily_report.to_sql('daily_report', con, if_exists='replace', index=False)
time_series.to_sql('time_series', con, if_exists='replace', index=False)
cur = con.cursor()
```

## Load: `lookup_table`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE lookup_table RENAME TO lookup_table_no_keys;
CREATE TABLE lookup_table (
    UID INTEGER,
    Combined_Key TEXT,
    iso2 TEXT,
    iso3 TEXT,
    Country_Region TEXT,
    Province_State TEXT,
    Admin2 TEXT,
    Lat REAL,
    Long_ REAL,
    Population INTEGER,
    PRIMARY KEY (UID)
);
INSERT INTO lookup_table SELECT * FROM lookup_table_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load: `daily_report`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE daily_report RENAME TO daily_report_no_keys;
CREATE TABLE daily_report (
    Combined_Key TEXT,
    Last_Update TEXT,
    Confirmed INTEGER,
    Deaths INTEGER,
    PRIMARY KEY (Combined_Key),
    FOREIGN KEY (Combined_Key) REFERENCES lookup_table (Combined_Key) 
            ON DELETE CASCADE ON UPDATE NO ACTION
);
INSERT INTO daily_report SELECT * FROM daily_report_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load: `time_series`

```sql
PRAGMA foreign_keys=off;
BEGIN TRANSACTION;
ALTER TABLE time_series RENAME TO time_series_no_keys;
CREATE TABLE time_series (
    Date TEXT,
    Country_Region TEXT,
    Confirmed INTEGER,
    Deaths INTEGER,
    Daily_Cases INTEGER,
    Daily_Deaths INTEGER,
    PRIMARY KEY (Date, Country_Region),
    FOREIGN KEY (Country_Region) REFERENCES lookup_table (Country_Region) 
            ON DELETE CASCADE ON UPDATE NO ACTION
);
INSERT INTO time_series SELECT * FROM time_series_no_keys;
COMMIT;
PRAGMA foreign_keys=on;
```

## Load(Cont'd)

```sql
DROP TABLE lookup_table_no_keys;
DROP TABLE daily_report_no_keys;
DROP TABLE time_series_no_keys;
```

## ER diagram

> An entityrelationship model (or ER model) describes interrelated things of interest in a specific domain of knowledge. A basic ER model is composed of entity types (which classify the things of interest) and specifies relationships that can exist between entities (instances of those entity types).

Source: <https://en.wikipedia.org/wiki/Entity%E2%80%93relationship_model>

## ER diagram of `covid19.db`

![](https://i.imgur.com/FuQXsEj.png)